{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "String": " "
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<unk>": 0,
      " ": 1,
      ".": 2,
      "A": 3,
      "B": 4,
      "C": 5,
      "D": 6,
      "E": 7,
      "F": 8,
      "G": 9,
      "H": 10,
      "I": 11,
      "J": 12,
      "K": 13,
      "L": 14,
      "M": 15,
      "N": 16,
      "O": 17,
      "P": 18,
      "Q": 19,
      "R": 20,
      "S": 21,
      "T": 22,
      "U": 23,
      "V": 24,
      "W": 25,
      "X": 26,
      "Y": 27,
      "Z": 28,
      "a": 29,
      "b": 30,
      "c": 31,
      "d": 32,
      "e": 33,
      "f": 34,
      "g": 35,
      "h": 36,
      "i": 37,
      "j": 38,
      "k": 39,
      "l": 40,
      "m": 41,
      "n": 42,
      "o": 43,
      "p": 44,
      "q": 45,
      "r": 46,
      "s": 47,
      "t": 48,
      "u": 49,
      "v": 50,
      "w": 51,
      "x": 52,
      "y": 53,
      "z": 54,
      "er": 55,
      "pp": 56,
      "upp": 57,
      "upper": 58,
      "ch": 59,
      "cho": 60,
      "echo": 61,
      "ao": 62,
      "vt": 63,
      "qq": 64,
      "xd": 65,
      "A.": 66,
      "ng": 67,
      "fq": 68,
      "jt": 69,
      "zm": 70,
      "O.": 71,
      "U.": 72,
      "oi": 73,
      "vy": 74,
      "fl": 75,
      "j.": 76,
      "n.": 77,
      "ub": 78,
      "wr": 79,
      "G.": 80,
      "ba": 81,
      "db": 82,
      "e.": 83,
      "yh": 84,
      "H.": 85,
      "N.": 86,
      "X.": 87,
      "df": 88,
      "eq": 89,
      "jg": 90,
      "lt": 91,
      "rl": 92,
      "tn": 93,
      "vg": 94,
      "L.": 95,
      "fn": 96,
      "jw": 97,
      "pa": 98,
      "s.": 99
    },
    "merges": [
      "e r",
      "p p",
      "u pp",
      "upp er",
      "c h",
      "ch o",
      "e cho",
      "a o",
      "v t",
      "q q",
      "x d",
      "A .",
      "n g",
      "f q",
      "j t",
      "z m",
      "O .",
      "U .",
      "o i",
      "v y",
      "f l",
      "j .",
      "n .",
      "u b",
      "w r",
      "G .",
      "b a",
      "d b",
      "e .",
      "y h",
      "H .",
      "N .",
      "X .",
      "d f",
      "e q",
      "j g",
      "l t",
      "r l",
      "t n",
      "v g",
      "L .",
      "f n",
      "j w",
      "p a",
      "s ."
    ]
  }
}